In [3]:
import pandas as pd

In [4]:
li = { "Name" : ["Zohaib", "Iqra", "Sara"], "Age" : [20, 19, 20], "Slary":[1000000, 200000, 300800]}

In [5]:
pd.DataFrame(li)

     Name  Age    Slary
0  Zohaib   20  1000000
1    Iqra   19   200000
2    Sara   20   300800

In [6]:
database = pd.read_excel("multiple_linear_regression.xlsx")
database.head(5)

                  Name  Age  Experience (Years)  Education (Years)    Salary
0  Mr. Johnathan Davis   56                   8                 15  14372.40
1           Kelly Reed   46                   7                 10  12641.59
2        Chelsea Moore   32                  11                 18  13918.89
3        Paige Goodwin   25                  33                 15  16396.54
4        Kelly Rosario   38                  32                 12  15350.48

In [7]:
# database.drop(columns=["Name"], inplace=True)

In [8]:
database

                   Name  Age  Experience (Years)  Education (Years)    Salary
0   Mr. Johnathan Davis   56                   8                 15  14372.40
1            Kelly Reed   46                   7                 10  12641.59
2         Chelsea Moore   32                  11                 18  13918.89
3         Paige Goodwin   25                  33                 15  16396.54
4         Kelly Rosario   38                  32                 12  15350.48
..                  ...  ...                 ...                ...       ...
95         Stacy Oneill   59                  37                 10  18533.58
96     Michelle Delgado   56                  23                 14  16357.04
97        Jacob Watkins   58                   4                 15  15326.47
98          David Stone   45                  33                 12  17998.65
99           Sara Patel   24                   5                 18   9321.27

[100 rows x 5 columns]

In [9]:
database.isnull().sum()

Name                  0
Age                   0
Experience (Years)    0
Education (Years)     0
Salary                0
dtype: int64

In [10]:
database.shape

(100, 5)

In [11]:
database.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 100 entries, 0 to 99
Data columns (total 5 columns):
 #   Column              Non-Null Count  Dtype
---  ------              --------------  -----
 0   Name                100 non-null    object
 1   Age                 100 non-null    int64
 2   Experience (Years)  100 non-null    int64
 3   Education (Years)   100 non-null    int64
 4   Salary              100 non-null    float64
dtypes: float64(1), int64(3), object(1)
memory usage: 4.0+ KB

In [12]:
database.describe()

              Age  Experience (Years)  Education (Years)        Salary
count  100.000000           100.00000         100.000000    100.000000
mean    37.910000            20.41000          13.860000  14125.654700
std     12.219454            12.60519           2.774414   3084.505346
min     18.000000             0.00000          10.000000   6700.620000
25%     26.750000             8.00000          12.000000  12018.860000
50%     38.000000            23.00000          13.000000  13895.580000
75%     46.250000            31.00000          16.000000  16366.915000
max     59.000000            39.00000          19.000000  21810.400000

In [13]:
# data : int =database["Name"].duplicated().sum()
data : int =database.duplicated().sum()
data

np.int64(0)

In [14]:
database.drop_duplicates(inplace=True)

In [15]:
database.dropna(inplace=True)

In [16]:
database.fillna(database.mode())

                   Name  Age  Experience (Years)  Education (Years)    Salary
0   Mr. Johnathan Davis   56                   8                 15  14372.40
1            Kelly Reed   46                   7                 10  12641.59
2         Chelsea Moore   32                  11                 18  13918.89
3         Paige Goodwin   25                  33                 15  16396.54
4         Kelly Rosario   38                  32                 12  15350.48
..                  ...  ...                 ...                ...       ...
95         Stacy Oneill   59                  37                 10  18533.58
96     Michelle Delgado   56                  23                 14  16357.04
97        Jacob Watkins   58                   4                 15  15326.47
98          David Stone   45                  33                 12  17998.65
99           Sara Patel   24                   5                 18   9321.27

[100 rows x 5 columns]

In [17]:
database["Salary"] = database["Salary"].fillna(database["Salary"].mean())

In [18]:
database["Name"] = database["Name"].fillna(database["Name"].mode()[0])

In [19]:
database.loc[(database["Salary"] > 10000, "Tax Salary %")] = "20%"
database.loc[(database["Salary"] < 10000, "Tax Salary %")] = "0%"

In [20]:
database

,Name,Age,Experience (Years),Education (Years),Salary,Tax Salary %
0,Mr. Johnathan Davis,56,8,15,14372.40,20%
1,Kelly Reed,46,7,10,12641.59,20%
2,Chelsea Moore,32,11,18,13918.89,20%
3,Paige Goodwin,25,33,15,16396.54,20%
4,Kelly Rosario,38,32,12,15350.48,20%
...,...,...,...,...,...,...
95,Stacy Oneill,59,37,10,18533.58,20%
96,Michelle Delgado,56,23,14,16357.04,20%
97,Jacob Watkins,58,4,15,15326.47,20%
98,David Stone,45,33,12,17998.65,20%
99,Sara Patel,24,5,18,9321.27,0%

<h1>Group By pandas</h1>

In [23]:
data = database.groupby("Experience (Years)").agg({"Salary": "mean"})

In [24]:
data

                          Salary
Experience (Years)
0                    9802.060000
1                   11286.942000
2                   10596.973333
3                   12364.735000
4                   14772.095000
5                    9960.765000
6                   10642.090000
7                   11021.170000
8                   13009.856667
10                  14904.910000
11                  13056.480000
12                  12251.453333
13                  11579.075000
14                  13311.875000
16                  13387.930000
18                  11031.490000
19                  12106.870000
21                  11580.840000
22                  14779.683333
23                  15066.230000
24                  12876.850000
25                  14135.063333
26                  15772.217500
27                  15607.572000
28                  13175.480000
29                  13651.775000
31                  16624.963750
32                  14995.017500
33                  17197.595000
34                  16378.733333
35                  16208.780000
36                  16556.710000
37                  18533.580000
38                  18413.053333
39                  14578.310000

<h1>Merge, Join, Concatenate in pandas</h1>

In [26]:
import pandas as pd

In [ ]:
data1 = {
    "ID": [1, 2, 3, 4, 5, 6, 7, 8, 9, 10],
    "Name": ["Zohaib", "Sara", "Hassan", "Ayesha", "Usman", "Zoya", "Bilal", "Fatima", "Ahmed", "Noor"],
    "Age": [20, 28, 22, 30, 27, 24, 29, 26, 31, 23],
    "Salary": [5000000, 60000, 45000, 70000, 55000, 48000, 62000, 53000, 75000, 47000]
}

# Data 2
data2 = {
    "ID": [11, 12, 13, 14, 15, 16, 17, 18, 19, 20],
    "Name": ["Hira", "Shahid", "Amina", "Omar", "Sana", "Imran", "Laila", "Faraz", "Maryam", "Raza"],
    "Age": [26, 32, 24, 29, 27, 31, 28, 25, 30, 33],
    "Salary": [52000, 68000, 47000, 60000, 54000, 71000, 59000, 48000, 67000, 73000]
}

In [47]:
a = pd.DataFrame(data1)

In [48]:
b = pd.DataFrame(data2)

In [51]:
pd.merge(a, b, on="ID", how="left")

   ID  Name_x  Age_x  Salary_x  Name_y  Age_y  Salary_y
0   1  Zohaib     20   5000000    Hira   26.0   52000.0
1   2    Sara     28     60000  Shahid   32.0   68000.0
2   3  Hassan     22     45000     NaN    NaN       NaN
3   4  Ayesha     30     70000     NaN    NaN       NaN
4   5   Usman     27     55000     NaN    NaN       NaN
5   6    Zoya     24     48000     NaN    NaN       NaN
6   7   Bilal     29     62000     NaN    NaN       NaN
7   8  Fatima     26     53000     NaN    NaN       NaN
8   9   Ahmed     31     75000     NaN    NaN       NaN
9  10    Noor     23     47000     NaN    NaN       NaN

In [54]:
data1 = {
    "ID": [1, 2, 3, 4, 5, 6, 7, 8, 9, 10],
    "Name": ["Zohaib", "Sara", "Hassan", "Ayesha", "Usman", "Zoya", "Bilal", "Fatima", "Ahmed", "Noor"],
    "Age": [20, 28, 22, 30, 27, 24, 29, 26, 31, 23],
    "Salary": [5000000, 60000, 45000, 70000, 55000, 48000, 62000, 53000, 75000, 47000]
}

# Data 2
data2 = {
    "ID": [11, 12, 13, 14, 15, 16, 17, 18, 19, 20],
    "Name": ["Hira", "Shahid", "Amina", "Omar", "Sana", "Imran", "Laila", "Faraz", "Maryam", "Raza"],
    "Age": [26, 32, 24, 29, 27, 31, 28, 25, 30, 33],
    "Salary": [52000, 68000, 47000, 60000, 54000, 71000, 59000, 48000, 67000, 73000]
}

In [55]:
pd.concat([a, b])

   ID    Name  Age   Salary
0   1  Zohaib   20  5000000
1   2    Sara   28    60000
2   3  Hassan   22    45000
3   4  Ayesha   30    70000
4   5   Usman   27    55000
5   6    Zoya   24    48000
6   7   Bilal   29    62000
7   8  Fatima   26    53000
8   9   Ahmed   31    75000
9  10    Noor   23    47000
0   1    Hira   26    52000
1   2  Shahid   32    68000
2  13   Amina   24    47000
3  14    Omar   29    60000
4  15    Sana   27    54000
5  16   Imran   31    71000
6  17   Laila   28    59000
7  18   Faraz   25    48000
8  19  Maryam   30    67000
9  20    Raza   33    73000